:LaTeX_PROPERTIES:
#+LANGUAGE: de
#+OPTIONS: d:nil todo:nil pri:nil tags:nil
#+OPTIONS: H:4
#+LaTeX_CLASS: orgstandard
#+LaTeX_CMD: xelatex
#+LATEX_HEADER: \usepackage{listings}
:END:

:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+REVEAL_THEME: league
#+REVEAL_EXTRA_CSS: ./mystyle.css
#+REVEAL_HLEVEL: 2
#+OPTIONS: timestamp:nil toc:nil num:nil
:END:

#+TITLE: Grundlegende Bash-Befehle 
#+SUBTITLE: ITS-Net-Lin
#+AUTHOR: Sebastian Meisel


#+BEGIN_SRC emacs-lisp :exports none
(require 'ox-latex)
(setq org-latex-listings 'listings)
(setq org-latex-listings-options
      '(("breaklines" "true")
        ("language" "bash")
        ("showspaces" "false")
        ("basicstyle" "\\small\\ttfamily")
        ("keywordstyle" "\\color{blue}")
        ("commentstyle" "\\color{gray}")
        ("stringstyle" "\\color{red}")
        ("numbers" "left")
        ("numberstyle" "\\tiny")
        ("frame" "tb")))
#+END_SRC

#+RESULTS:
| breaklines   | true             |
| language     | bash             |
| showspaces   | false            |
| basicstyle   | \small\ttfamily  |
| keywordstyle | \color{blue}     |
| commentstyle | \color{darkGrey} |
| stringstyle  | \color{red}      |
| numbers      | left             |
| numberstyle  | \tiny            |
| frame        | tb               |


